import React from 'react';

function SeasonDescription() {
  return (
    <div className='season-description-main-container'>
      <h2>Описание:</h2>
      <img
        src='https://cms.peaky-blinders.top/uploads/ac36dbe9db9a4b3cbadafb6315befd6d.png'
        alt=''
        className='season-description-first-image'
      ></img>
      <p>
        Друзья Уилла Дастин, Лукас и Майк начинают расследование его исчезновения. Разыскивая Уилла
        в местном лесу, мальчики находят лысую девочку в больничном халате, которой они разрешают
        остаться жить в подвале Майка. Компания узнает, что ее зовут Одиннадцать и она обладает
        способностями к психокинезу.
      </p>

      <p>
        Тем временем мать Уилла Джойс ужасно напугана: в доме творится что-то неладное с
        электричеством. Она твердо убеждена, что таким способом Уилл общается с ней. На фоне этих
        событий Джойс неоднократно становится свидетелем появления того же монстра, который схватил
        Уилла.
      </p>
      <img
        src='https://cms.peaky-blinders.top/uploads/ec5744197e2a4eb4ab79632a52ca5f8f.png'
        alt=''
        className='season-description-second-image'
      ></img>

      <p>
        Шериф местной полиции Джим Хоппер после нахождения оторванного клочка больничного халата за
        пределами национальной лаборатории, начинает с подозрением относиться к деятельности ученых.
        Старшая сестра Майка, Нэнси становится свидетелем появления странного существа, которое
        похищает ее подругу Барб на вечеринке. В карьере обнаружено тело Уилла, но Одиннадцать
        говорит, что мальчик все еще жив. Брат Уилла Джонатан осознает, что описание существа,
        сделанное Нэнси, совпадает с тем описанием, которое дала его мать: человекоподобная фигура с
        длинными руками и без лица.
      </p>

      <p>
        Подозрения одолевают Хоппера. Он вскрывает тело Уилла и обнаруживает, что это подделка.
        Шериф врывается в лабораторию, где находит спальню Одиннадцать и огромные открытые Врата,
        которые ведут в другое измерение. Здесь его настигают секретные агенты. Собрав воедино все
        сведения и предположения о сверхъестественных событиях, мальчики тоже начинают искать
        гипотетические Врата в потусторонний мир. Джойс и Хоппер вместе с детьми разрабатывают план
        создания сенсорного устройства для усиления способностей Одиннадцати — таким образом, она
        сможет увидеть Уилла и Барб без выхода на Обратную Сторону. Одиннадцать обнаруживает, что
        Барб мертва, а Уилл жив, но прячется.
      </p>

      <img
        src='https://cms.peaky-blinders.top/uploads/895dc6abe05a402a81f90014dfaa90c8.jpg'
        alt=''
        className='season-description-third-image'
      ></img>
      <p>
        Хоппер и Джойс возвращаются в лабораторию Хокинса, чтобы пройти через Врата и спасти Уилла,
        но их задерживает охрана. Шериф договаривается с Браннером. Хоппер и Джойс входят на
        Обратную Сторону, обнаруживая гнездо странного существа. После его убийства они спасают
        мальчика.
      </p>
      <p>
        Тем временем Одиннадцать убивает многих агентов, которые пытаются вернуть ее в лабораторию.
        Когда Бреннер находит ослабленную Одиннадцать, другой раненый монстр, привлеченный кровью,
        входит в школу и нападает на доктора. Ребята прячутся, но существо их находит. Одиннадцать
        контратакует, оглядывается и прощается с Майком. Девочка растворяет существо в густом
        тумане, в котором и сама исчезает. Майк плачет. Уилл находится в больнице, где происходит
        его воссоединение с друзьями и семьей, но на этом Очень странные дела не заканчиваются.
      </p>
    </div>
  );
}

export default SeasonDescription;
