import React from 'react';

function CurrentNews() {
  return (
    <div>
      <div className='current-news-container'>
        <div className='current-news-header'>
          <h1>Первоначальная сюжетная линия Стива и Робин: что изменилось?</h1>
          <p>2020-02-26</p>
        </div>

        <div className='current-news-content'>
          <img
            src='https://cms.peaky-blinders.top/uploads/7833771aab6143148a0394691ec252b6.jpg'
            alt=''
          ></img>
          <p>
            Стив и Робин остались просто друзьями в конце третьего сезона сериала "Очень странные
            дела", но это не было запланировано создателями изначально. Вот как изменилась сюжетная
            линия Робин.
          </p>
          <p>
            Когда третий сезон сериала "Очень странные дела" был только запущен в производство,
            ситуация между Стивом Харрингтоном и Робин Бакли по первоначальной задумке авторов
            должна была сильно отличаться от той, что в результате показали нам. Сезон, премьера
            которого состоялась на Netflix в июле 2019 года, познакомил мир с Джо Кири и Майей Хоук.
            Роль Робин особенно сильно понравилась поклонникам юной актрисы. Стив и Робин вместе
            работали. Эта парочка оказалась в центре основного сюжета третьего сезона, к концу
            которого между ними завязалась особая дружба. Отношения почти приняли романтический
            оттенок, но не тут-то было.
          </p>
          <p>
            Стив и Робин работали вместе в кафе-мороженом под названием Scoops Ahoy, расположенном в
            торговом центре Старкорт. Стив постоянно терпел неудачи на личном фронте, но упорно
            пытался соответствовать образу "крутого парня", из-за чего он часто становился объектом
            постоянных насмешек Робин. Робин, помогая ребятам проникнуть на секретную базу под
            торговым центром, легко перевела зашифрованное радио-послание от русских, которое Дастин
            случайно поймал в эфире. Стив и Робин были пойманы русскими, которые впоследствии
            подвергли пленников пыткам с целью выудить нужную информацию. Робин удалось остаться
            спокойной и сохранить преданность своим новым друзьям. Связавшись со Стивом, она
            раскрыла коллеге правду о своих истинных чувствах.
          </p>
          <p>
            Когда эффект от сыворотки правды начал постепенно сходить на нет, состояние Стива и
            Робин резко ухудшилось. Парочке пришлось провести немало времени в торговом центре, пока
            они сумели наконец-то прийти в себя и избавиться от остатков препарата. После этого
            Робин рассказала, что она вовсе не была одержима Стивом из-за своей влюбленности в него.
            Вместо этого она влюбилась в девушку, которая уделяла Стиву слишком много внимания.
            Стиву потребовалось время, чтобы понять, что у Робин — нетрадиционная ориентация. Парень
            не сразу принял эту новость, ставшую для него полной неожиданностью. Крутой сюжетный
            поворот с сексуальной ориентацией Робин не был запланированным. Изначально сценаристы
            хотели, чтобы у этой пары в конечном счете возникли романтические отношения. На
            протяжении большей части сезона Стив, похоже, постепенно влюбляется в Робин. Зрители это
            прекрасно заметили. Он понял, что она идеально подходит для него. Хоук и создатели шоу
            братья Даффер, очевидно, пришли к другому выводу в конце сезона.
          </p>
          <p>
            Решение сделать Робин лесбиянкой возникло у сценаристов только во время съемок
            четвертого или пятого эпизода. Хоук, братья Даффер и продюсеры начали обсуждать этот
            вопрос, так как все сошлись во мнении о том, что Робин и Стив не должны оставаться
            вместе в конце сезона. Они пришли к выводу, что было бы разумно сделать очень
            драматичную сцену из признания Робин перед Стивом. Она действительно стала одним из
            самых трогательных моментов в третьем сезоне. Хоук очень гордилась полученной
            возможностью раскрыть перед зрителями эту сторону своего персонажа. Она хотела, чтобы
            поклонники сериала смогли получить хоть какие-то представления о ЛГБТ-движении, а
            съемочная группа полностью поддержала молодую актрису.
          </p>
          <p>
            Хотя действие сериала "Очень странные дела" разворачивается в 1980-х годах, ситуация,
            связанная с каминг-аутом Робин, все еще актуальна и для современного общества. Многим
            зрителям казалось, что история Робин и Стива постепенно движется к предсказуемой
            романтической развязке, но создателям сериала удалось шокировать публику. Тот факт, что
            Стив и Робин не начали встречаться, вовсе не означает, что теперь их отношения будут
            окончательно разорваны. Как становится понятно из финала третьего сезона, их дружба на
            этом моменте только начинается.
          </p>
        </div>
      </div>
    </div>
  );
}

export default CurrentNews;
